testCases/T3B/kOmegaSSTLM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    flatPlate
    {
      type            kLowReWallFunction;
      value           uniform 0;
    }
    lowerSymmetry
    {
        type            zeroGradient;
    }
    upperSymmetry
    {
        type            zeroGradient;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.065;
        U               U;
        phi             phi;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
